%%%
%屏蔽效能计算-近场（电场）
%%%
%%%
%参数
%%%
clear all
clc


h = 0.1:0.1:6; %屏蔽体厚度 :mm
f = 1000:5000:25000; %频率 :Hz
r = 1; %屏蔽体到辐射源距离 :mm
U0 = 4*pi*10^-7; %真空中的磁导率: H/m

%铁
Ur = 500; %相对磁导率
O = 1e7; %电导率
Or = 0.175;

% %钢
% Ur = 1000; %相对磁导率
% O = 5.8e6; %电导率
% Or = 0.1;

% %坡莫合金
% Ur = 20000; %相对磁导率
% O = 1.74e6; %电导率
% Or = 0.03;

% %铜
% Ur = 1; %相对磁导率
% O = 5.7e7; %电导率
% Or = 1;

% %铝
% Ur = 1; %相对磁导率
% O = 3.54e7; %电导率
% Or = 0.62;

% %dm为低频时最大贯穿深度 :mm
% dm = sqrt( 1 ./ (pi .* f * Ur * U0 * O) ) .* 10^3;
% plot(f,dm)

%%%
%1kHz,比较不同材料、厚度的屏蔽效能
%%%
% 吸收损耗A：dB

for i= 1:1:length(f)
    
A(i,:) = 0.131 .* h * sqrt( Ur * Or * f(i));

%多次反射损耗
B = 10*log10(1-2*10.^(-0.1.*A).*cos(0.23.*A) + 10.^(-0.2.*A));

%近电场反射损耗ReE： dB
ReE(i,1:length(h)) = 321.7 + 10*log10(Or/(f(i)^3*Ur*r^2));

%近磁场反射损耗ReM ：dB
ReM(i,1:length(h)) = 14.6 + 10*log10(Or*f(i)*r^2/Ur);

%屏蔽效能 ：dB
SEe = A + B + ReE; %近电场

SEm = A + B + ReM; %近磁场

end

plot(h,SEm)







